#  Вывести на экран все четные значения от 1 до 100
n = 0

while n < 100:
    n +=2
    print(n, end=" ")
    
   