# Вывести на экран все нечетные значения от 1 до 300
n = -1

while n < 299:
    n +=2
    print(n, end=" ")