# 2. Напишите функцию, которая будет открывать заранее созданый тхт файл и выводить содержимое на экран (тхт создать самим и наполнить)

with open('C:/Users/user/Desktop/Python/phyton/9lesson/t1.txt') as f1:
    rf = f1.read()
    print(rf)

