# 2. Напишите функцию, которая будет выводить информацию о всех файлах и подкаталогах в произвольной папке на вашем пк

import os
os.chdir('9lesson')
print(os.listdir('c://'))
print(os.getcwd())


